// ДЗ 1
// Написати свою реалізацію функції isNaN. 
// Умови виконання ДЗ
// Не використовувати функції або інші матеріали які ми не вивчали
// Не використовувати isNaN/ Number.isNaN
// customIsNaN має бути ідентичною за логікою до isNaN


// ДЗ 2
// Перевірка теорії ймовірності. Напишіть функцію яка буде генерувати певну кількість випадкових чисел в діапазоні від 100 до 1000 включно. 
// Порахувати кількість парних та непарних серед них. Обчислити відсоткове співвідношення - чи буде воно близьке до 50%50? 
// Приклад функції checkProbabilityTheory(count). Параметр count буде вказувати скільки разів буде генеруватися випадкове число.
// Уmови виконання ДЗ

// Функція виводить інформацію 
// Кількість згенерованих чисел: кількість чисел
// Парних чисел: кількість парних чисел
// Не парних чисел: кількість не парних чисел
// Відсоток парних до не парних: 
// ДЗ 3

// Вивести на екран суму чисел від 1 до 100 включно, які не кратні 3.

// Умови виконання ДЗ

// Не використовувати функції або інші матеріали які ми не вивчали
// Намагайтесь робити ДЗ самостійно та не дивитися будь-які підказки
// Додаткова задача:

// Напишіть функцію на JavaScript, яка приймає рядок, виокремлює з нього всі цілі числа (ігноруючи дробові числа), 
//перетворює їх з текстового формату в числовий  та обчислює їхню загальну суму.

// Вимоги:

// Функція повинна ітерувати кожен символ у вхідному рядку.
// Використовуйте цикл для перегляду кожного символу та збору повних цілочисельних значень.
// Ігноруйте нечислові символи та дробові числа під час обрахунку суми цілих чисел (якщо у нас зустрічається таки запис 123.23 - 
// то сума має бути 146, 123+23=146). 
// Після визначення кожного цілого числа додайте його до загальної суми.
// Не використовувати масиви та регулярні вирази для рішення
// console.log(sumIntegersInString("123.45px-67 8.9")); // Виведе 118, сумуючи 123, 45, -67, 8 та 9
// Будь ласка, надайте наступні дані для перевірки вашої роботи:

// Створіть гілку у репозиторії.
// Додати туди ваше домашнє завдання
// Вислати вашу гілку




// ДЗ 1
function customIsNaN(value) {
    return value !== value;
}

console.log(customIsNaN('Hello'));