// 1. Задача: Конвертер валют
// Завдання: Напишіть функцію convertCurrency, яка приймає суму в доларах США (USD) і код валюти, в яку потрібно конвертувати ('EUR', 'UAH', 'GBP').
 // Функція повинна повертати суму у вказаній валюті, використовуючи фіксовані курси валют (наприклад, 1 USD = 0.9 EUR, 1 USD = 35 UAH, 1 USD = 0.8 GBP). 
 // Якщо код валюти не підтримується, функція повинна повертати рядок з помилкою.

// 2. Задача: Визначення дня тижня
// Завдання: Створіть функцію getDayOfWeek, яка приймає число від 1 до 7 і повертає назву дня тижня, де 1 - це понеділок, а 7 - неділя.
// Якщо введене число не відповідає жодному дню тижня, функція має повертати рядок з помилкою.

// 3.Задача: Знайти число Фібоначчі
// Завдання: Напишіть функцію fibonacci, що приймає число n як аргумент і повертає n-те число з послідовності Фібоначчі. 
// Послідовність починається з 0 (нульовий елемент) і 1 (перший елемент), а кожне наступне число є сумою двох попередніх чисел.

// Приклади використання:
// Для n = 0:
// Вхід: fibonacci(0)
// Вихід: 0
// Опис: Нульовий елемент послідовності Фібоначчі — це 0.

// Для n = 4:
// Вхід: fibonacci(4)
// Вихід: 3
// Опис: Четвертий елемент послідовності Фібоначчі (0, 1, 1, 2, 3) — це 3 (1 + 2).

// Додаткова задача. Вгадай число

// Напишіть функцію guessNumber, яка приймає рядок від користувача через prompt() і порівнює його з випадково згенерованим числом від 1 до 10 (включно). 
// Функція має виводити 'Вгадали!', якщо користувач вгадав число, або 'Спробуйте ще раз!', якщо ні. Враховуйте перетворення типів та умовні конструкції. 
// Також треба додати наступні функціональні можливості:
// Обмежена кількість спроб: Користувач має обмежену кількість спроб, наприклад, 3 спроби, щоб вгадати число. Використовувати рекурсію, а не цикли. 
// Підказки: Якщо користувач вводить число, яке не співпадає з загаданим, але залишилися спроби, функція надає підказку: "занадто велике" або "занадто мале".
// Валідація вводу: Переконайтеся, що користувач ввів дійсне число в потрібному діапазоні (від 1 до 10). 
// Якщо введене значення недійсне, прохання ввести число знову не зараховуючи це як спробу.

